const levels = [
  {
    title: "Легкий",
    desc: "Розмір стимулів 2см",
    value: "1",
    size: 76,
    icon: { icon: "tabler-rocket", size: "28" },
    description:
      " <h1 style='text-align: center'>Легкий рівень</h1>\n" +
      "    \n" +
      "    <h2>Кому підходить?</h2>\n" +
      "    <ul>\n" +
      "        <li>Пацієнтам на початковому етапі реабілітації.</li>\n" +
      "        <li>Тим, хто має значні порушення уваги або когнітивні проблеми.</li>\n" +
      "        <li>Для первинної діагностики візуально-просторового або об’єктного неглекту.</li>\n" +
      "    </ul>\n" +
      "    \n" +
      "    <h2>Характеристики тесту:</h2>\n" +
      "    <ul>\n" +
      "        <li>Використовується тільки <strong>Single Task</strong>: пацієнт виконує одне завдання.</li>\n" +
      "        <li>Мінімальна кількість стимулів на дошці, щоб уникнути перевантаження.</li>\n" +
      "        <li>Візуальні стимули розташовані просто та зрозуміло, без складних відволікаючих елементів.</li>\n" +
      "        <li>Інтервали між появою стимулів довші, що дозволяє пацієнту реагувати без поспіху.</li>\n" +
      "    </ul>\n" +
      "    \n" +
      "    <h2>Мета:</h2>\n" +
      "    <ul>\n" +
      "        <li>Розвивати базові навички уваги та розпізнавання.</li>\n" +
      "        <li>Підготувати пацієнта до складніших рівнів.</li>\n" +
      "    </ul>",
  },
  {
    title: "Середній",
    desc: "Розмір стимулів 1.5см",
    value: "2",
    size: 57,
    icon: { icon: "tabler-star", size: "28" },
    description:
      " <h1 style='text-align: center'>Середній рівень</h1>\n" +
      "    \n" +
      "    <h2>Кому підходить?</h2>\n" +
      "    <ul>\n" +
      "        <li>Пацієнтам із помірними когнітивними або зорово-моторними порушеннями.</li>\n" +
      "        <li>Тим, хто вже досяг прогресу на легкому рівні.</li>\n" +
      "        <li>Для пацієнтів із залишковими симптомами неглекту.</li>\n" +
      "    </ul>\n" +
      "    \n" +
      "    <h2>Характеристики тесту:</h2>\n" +
      "    <ul>\n" +
      "        <li>Використовується <strong>Single Task</strong> або <strong>Dual Task</strong>, залежно від цілей терапії.</li>\n" +
      "        <li>Збільшена кількість стимулів на дошці, які розташовані щільніше.</li>\n" +
      "        <li>Візуальні стимули більш схожі один на одного, включаючи відволікаючі елементи.</li>\n" +
      "    </ul>\n" +
      "    \n" +
      "    <h2>Мета:</h2>\n" +
      "    <ul>\n" +
      "        <li>Тренувати здатність обробляти більшу кількість інформації.</li>\n" +
      "        <li>Покращувати швидкість реакції та вибіркову увагу.</li>\n" +
      "    </ul>",
  },
  {
    title: "Важкий ",
    desc: "Розмір стимулів 1см",
    value: "3",
    size: 38,
    icon: { icon: "tabler-crown", size: "28" },
    description:
      " <h1 style='text-align: center'>Важкий рівень</h1>\n" +
      "    \n" +
      "    <h2>Кому підходить?</h2>\n" +
      "    <ul>\n" +
      "        <li>Пацієнтам на пізньому етапі реабілітації.</li>\n" +
      "        <li>Тим, хто готовий працювати з інтенсивними когнітивними навантаженнями.</li>\n" +
      "        <li>Для моделювання складних багатозадачних ситуацій, що зустрічаються в повсякденному житті.</li>\n" +
      "    </ul>\n" +
      "    \n" +
      "    <h2>Характеристики тесту:</h2>\n" +
      "    <ul>\n" +
      "        <li>Використовується переважно <strong>Dual Task</strong> для підвищення когнітивного навантаження.</li>\n" +
      "        <li>Висока щільність стимулів: велика кількість цільових і фальшивих елементів.</li>\n" +
      "        <li>Візуально складні стимули з мінімальними відмінностями між цільовими та фальшивими елементами.</li>\n" +
      "        <li>Малий розмір стимулів.</li>\n" +
      "    </ul>\n" +
      "    \n" +
      "    <h2>Мета:</h2>\n" +
      "    <ul>\n" +
      "        <li>Тренувати багатозадачність та адаптацію до реальних життєвих умов.</li>\n" +
      "        <li>Покращувати здатність обробляти складну інформацію під час стресових ситуацій.</li>\n" +
      "    </ul>",
  },
];

export default levels;
